
console.log("let mode = \"normal\" - да");
console.log("let my_valu3 = 102 - да но не соблюден рекомендованный стиль camel case");
console.log("let 3my_value3 = \"102\" - нет, название не должно начтнаться на цифру");
console.log("__hello__ = \"world\" - да");
console.log("let $$$ = \"money\" - да");
console.log("let !0_world = true - нет восклицательный знак не разрешается использовать в начале имени переменной");

// 4 Напишите, являются ли данные имена переменных корректными:
// let mode = "normal" - да;
// let my_valu3 = 102 - да но не соблюден рекомендованный стиль camel case;
// let 3my_value3 = "102" - нет, название не должно начинаться на цифру;
// let __hello__ = "world" - да;
// let $$$ = "money" - да;
// let !0_world = true - нет восклицательный знак не разрешается использовать в начале имени переменной;